# Capstone Two: EDA

In [1]:
import os
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt 
import seaborn as sns

#suppress future warnings
import warnings
warnings.simplefilter(action='ignore', category=FutureWarning)
warnings.simplefilter(action='ignore', category=UserWarning)

# Show plots inline
%matplotlib inline

In [2]:
#import sys
#!{sys.executable} -m pip install stem

In [8]:
path1 = os.getcwd()

In [20]:
path2 = path1[:-10]

In [21]:
path2

'/home/kc3pve/Desktop/Spring-Git/Springboard/Credit'

In [22]:
path3 = path2 +'/' +'data'

In [23]:
path3

'/home/kc3pve/Desktop/Spring-Git/Springboard/Credit/data'

In [30]:
X_df1 = path3 + '/' +'X_df.csv'
Y_df1 = path3 + '/' +'Y_df.csv'

In [32]:
X_df2 = pd.read_csv(X_df1)
Y_df2 = pd.read_csv(Y_df1)

In [29]:
X_df2

,Unnamed: 0,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,CNT_FAM_MEMBERS
0,0,1,0,1,1,126000.000000,4,4,0,1,-12301,-140,3.0
1,1,1,0,1,2,337500.000000,0,4,1,1,-9732,-134,4.0
2,2,0,0,1,1,90000.000000,4,1,1,1,-13546,-3373,3.0
3,3,1,1,1,1,157500.000000,4,4,1,1,-17991,-3304,3.0
4,4,1,1,0,1,315000.000000,0,1,1,5,-11689,-716,3.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
16737,4983,1,0,0,1,335439.925489,0,1,1,1,-16632,-2493,3.0
16738,4984,0,0,1,1,202500.000000,0,4,1,1,-14653,-314,3.0
16739,4985,1,1,0,1,180000.000000,4,4,1,1,-15391,-958,3.0
16740,4986,1,1,1,2,211500.000000,4,4,1,1,-10435,-2987,4.0
16741,4987,0,0,1,1,76500.000000,1,4,1,1,-20442,365243,3.0

In [33]:
Y_df2

       Unnamed: 0  STATUS
0               0       0
1               1       0
2               2       0
3               3       0
4               4       0
...           ...     ...
16737        4983       1
16738        4984       1
16739        4985       1
16740        4986       1
16741        4987       1

[16742 rows x 2 columns]

In [34]:
Y_df2.head()

   Unnamed: 0  STATUS
0           0       0
1           1       0
2           2       0
3           3       0
4           4       0

In [35]:
display(X_df2.shape)

(16742, 13)

In [36]:
display(Y_df2.shape)

(16742, 2)

In [37]:
X_df2.columns

Index(['Unnamed: 0', 'CODE_GENDER', 'FLAG_OWN_CAR', 'FLAG_OWN_REALTY',
       'CNT_CHILDREN', 'AMT_INCOME_TOTAL', 'NAME_INCOME_TYPE',
       'NAME_EDUCATION_TYPE', 'NAME_FAMILY_STATUS', 'NAME_HOUSING_TYPE',
       'DAYS_BIRTH', 'DAYS_EMPLOYED', 'CNT_FAM_MEMBERS'],
      dtype='object')

In [38]:
Y_df2.columns

Index(['Unnamed: 0', 'STATUS'], dtype='object')

In [40]:
X_df2.dtypes

Unnamed: 0               int64
CODE_GENDER              int64
FLAG_OWN_CAR             int64
FLAG_OWN_REALTY          int64
CNT_CHILDREN             int64
AMT_INCOME_TOTAL       float64
NAME_INCOME_TYPE         int64
NAME_EDUCATION_TYPE      int64
NAME_FAMILY_STATUS       int64
NAME_HOUSING_TYPE        int64
DAYS_BIRTH               int64
DAYS_EMPLOYED            int64
CNT_FAM_MEMBERS        float64
dtype: object

In [41]:
Y_df2.dtypes

Unnamed: 0    int64
STATUS        int64
dtype: object

# Summary Statistics

In [44]:
X_df2.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
Unnamed: 0,16742.0,4868.591506,3330.942790,0.0,2092.25,4185.0,7567.75,11753.0
CODE_GENDER,16742.0,0.351451,0.477438,0.0,0.00,0.0,1.00,1.0
FLAG_OWN_CAR,16742.0,0.386991,0.487076,0.0,0.00,0.0,1.00,1.0
FLAG_OWN_REALTY,16742.0,0.565046,0.495766,0.0,0.00,1.0,1.00,1.0
CNT_CHILDREN,16742.0,1.300024,0.463595,1.0,1.00,1.0,2.00,3.0
AMT_INCOME_TOTAL,16742.0,195657.940057,109302.892651,45000.0,135000.00,166500.0,225000.00,900000.0
NAME_INCOME_TYPE,16742.0,2.558715,1.706038,0.0,1.00,4.0,4.00,4.0
NAME_EDUCATION_TYPE,16742.0,2.896309,1.349060,0.0,1.00,4.0,4.00,4.0
NAME_FAMILY_STATUS,16742.0,0.908016,0.422639,0.0,1.00,1.0,1.00,4.0
NAME_HOUSING_TYPE,16742.0,1.299785,0.941905,0.0,1.00,1.0,1.00,5.0
DAYS_BIRTH,16742.0,-13362.270995,2435.721936,-25010.0,-14955.75,-13154.5,-11459.00,-7980.0
DAYS_EMPLOYED,16742.0,5178.681520,52029.394782,-14473.0,-3189.25,-1816.0,-926.00,365243.0
CNT_FAM_MEMBERS,16742.0,3.352752,0.452147,3.0,3.00,3.0,4.00,4.0

Insights:

● 

●  

● 

Potential Issues:

● 

●  

●

In [52]:
X_df2['NAME_FAMILY_STATUS']

0        0
1        1
2        1
3        1
4        1
        ..
16737    1
16738    1
16739    1
16740    1
16741    1
Name: NAME_FAMILY_STATUS, Length: 16742, dtype: int64

In [53]:
X_df2['AMT_INCOME_TOTAL']

0        126000.000000
1        337500.000000
2         90000.000000
3        157500.000000
4        315000.000000
             ...
16737    335439.925489
16738    202500.000000
16739    180000.000000
16740    211500.000000
16741     76500.000000
Name: AMT_INCOME_TOTAL, Length: 16742, dtype: float64

In [54]:
X_df2['NAME_INCOME_TYPE']

0        4
1        0
2        4
3        4
4        0
        ..
16737    0
16738    0
16739    4
16740    4
16741    1
Name: NAME_INCOME_TYPE, Length: 16742, dtype: int64

In [55]:
X_df2['DAYS_EMPLOYED']

0          -140
1          -134
2         -3373
3         -3304
4          -716
          ...
16737     -2493
16738      -314
16739      -958
16740     -2987
16741    365243
Name: DAYS_EMPLOYED, Length: 16742, dtype: int64

In [58]:
X_df2['CNT_FAM_MEMBERS']

0        3.0
1        4.0
2        3.0
3        3.0
4        3.0
        ...
16737    3.0
16738    3.0
16739    3.0
16740    4.0
16741    3.0
Name: CNT_FAM_MEMBERS, Length: 16742, dtype: float64

In [69]:
Y_df2.describe().transpose()

#Y_df2

,count,mean,std,min,25%,50%,75%,max
Unnamed: 0,16742.0,4868.591506,3330.942790,0.0,2092.25,4185.0,7567.75,11753.0
STATUS,16742.0,0.500000,0.500015,0.0,0.00,0.5,1.00,1.0

In [68]:
#0: 1-29 days past due 1: 30-59 days past due 
#2: 60-89 days overdue 3: 90-119 days overdue 
#4: 120-149 days overdue 5: Overdue or bad debts, write-offs for more than 150 days 
#C: paid off that month 
#X: No loan for the month

Y_df2['STATUS']

0        0
1        0
2        0
3        0
4        0
        ..
16737    1
16738    1
16739    1
16740    1
16741    1
Name: STATUS, Length: 16742, dtype: int64